<?php
/*
  $Id: _jppercel.php,v 1.0 2004/06/17 11:28:46 ptosh Exp $

  Japanese Postal Service Shipping Calculator.
  Calculate shipping costs.

  2004/06/17 written by TAMURA Toshihiko (tamura@bitscope.co.jp)
  2006/01/20 mod. for Zen-Cart by Tackmix(master@tackmix.com)
  2008/03/24 add. by kimono(maeda@obitastar.co.jp)

 */
/*
(適応するサービス)
以下の種別に対応して料金を計算する。
-----------------------------------------------
種別                               id
-----------------------------------------------
小形包装物:航空便                  jppercelairs
小形包装物:船便                    jppercelseas
小形包装物:エコノミー航空(SAL)便   jppercelsals
小包郵便物:航空小包                jppercelair
小包郵便物:エコノミー航空(SAL)小包 jppercelsal
小包郵便物:船便小包                jppercelsea
国際スピード郵便(EMS)              jppercelems
-----------------------------------------------

(参考)
国際郵便料金表:
 http://www.post.japanpost.jp/fee/simulator/kokusai/
国際郵便条件表:
 http://www.post.japanpost.jp/service/intel_service/ko_johken/html/naate.htm
ISO国コード:
 http://www.iso.org/iso/en/prods-services/iso3166ma/02iso-3166-code-lists/list-en1.html

(使用方法)
    $percel = new _JpPercel('jppercelair','航空小包');
    $percel->SetDest('US');     // アメリカ合衆国まで
    $percel->SetWeight(10);     // kg
    $quote = $percel->GetQuote();
    print $quote['title']."(". $quote['id'] . "): cost=" . $quote['cost'] . "<br>\n";
*/
if ( !defined('JPPERCEL') ) {
  define('JPPERCEL', 1);

class _JpPercel {
    public $quote;
    public $DestCountryCode = NULL;
    public $Weight = 0;
    public $Areas = array(
/* 東アジア   */ 'easia'   =>array('CN','HK','TW','KR','PH','MO','MN'),
/* 西太平洋   */ 'wpacific'=>array('GU','MP','AS'),
/* 東南アジア */ 'seasia'  =>array('SG','TH','MY','VN','ID','KH','BN','MM','LA'),
/* 西南アジア */ 'swasia'  =>array('IN','LK','NP','PK','BD','BT','MV'),
/* オセアニア */ 'oceania' =>array('AU','SB','NZ','NC','PG','FJ'),
/* 中近東     */ 'mneast'  =>array('AE','IL','IQ','IR','OM','QA','KW','CY','SY','SA','JO','TR','BH'),
/* ヨーロッパ */ 'europe'  =>array('IS','IE','AZ','IT','UA','GB','EE','AT','NL','GR','HR','CH',
                                   'SE','ES','SK','SI','CZ','DK','DE','NO','HU','FR','FI','BY',
                                   'BE','BG','PL','PT','MK','MT','LV','LT','LI','LU','RO','RU'),
/* 北米       */ 'namerica'=>array('CA'),
/* USA       */ 'america'=>array('US','PR','VI'),
/* 中米       */ 'camerica'=>array('SV','CU','CR','TT','JM','PA','BB','HN','MX'),
/* 南米       */ 'samerica'=>array('AR','UY','VE','EC','CO','CL','PY','BR','PE'),
/* アフリカ   */ 'africa'  =>array('DZ','UG','EG','ET','GH','GA','KE','SL','SD','DJ','ZW','SN',
                                   'CI','TZ','TN','TG','NG','BW','MG','ZA','MU','MA','RW'),
    );
    // 小包郵便物の価格ランク: (最大重量(kg),第1地帯,第2地帯,第3地帯,第4地帯)
    public $a_price_percel = array(
    // 小形包装物:航空便
    'jppercelairs'=>array(
      array(0.10, 350, 480, 510, 750),// 0.1kg以下,第1,第2,第3,第4地帯
      array(0.20, 450, 600, 680, 880),
      array(0.30, 550, 720, 850,1010),
      array(0.40, 650, 840,1020,1140),
      array(0.50, 750, 960,1190,1270),
      array(0.60, 850,1080,1360,1400),
      array(0.70, 950,1200,1530,1530),
      array(0.80,1050,1320,1700,1660),
      array(0.90,1150,1440,1870,1790),
      array(1.00,1250,1560,2040,1920),
      array(1.10,1350,1680,2210,2050),
      array(1.20,1450,1800,2380,2180),
      array(1.30,1550,1920,2550,2310),
      array(1.40,1650,2040,2720,2440),
      array(1.50,1750,2160,2890,2570),
      array(1.60,1850,2280,3060,2700),
      array(1.70,1950,2400,3230,2830),
      array(1.80,2050,2520,3400,2960),
      array(1.90,2150,2640,3570,3090),
      array(2.00,2250,2760,3740,3220),
      ),
    // 小形包装物:船便 04-2021
    'jppercelseas'=>array(
      array(0.10, 480, 480, 480, 480),// 0.1kg以下,第1,第2,第3,第4地帯
      array(0.25, 570, 570, 570, 570),
      array(0.50, 720, 720, 720, 720),
      array(1.00,1010,1010,1010,1010),
      array(2.00,1600,1600,1600,1600),
      ),
    // 小形包装物:エコノミー航空(SAL)便
    'jppercelsals'=>array(
      array(0.1, 320, 440, 470, 720),// 0.1kg以下,第1,第2,第3,第4地帯
      array(0.2, 395, 530, 590, 820),
      array(0.3, 470, 620, 710, 920),
      array(0.4, 545, 710, 830,1020),
      array(0.5, 620, 800, 950,1120),
      array(0.6, 695, 890,1070,1220),
      array(0.7, 770, 980,1190,1320),
      array(0.8, 845,1070,1310,1420),
      array(0.9, 920,1160,1430,1520),
      array(1.0, 995,1250,1550,1620),
      array(1.1,1070,1340,1670,1720),
      array(1.2,1145,1430,1790,1820),
      array(1.3,1220,1520,1910,1920),
      array(1.4,1295,1610,2030,2020),
      array(1.5,1370,1700,2150,2120),
      array(1.6,1445,1790,2270,2220),
      array(1.7,1520,1880,2390,2320),
      array(1.8,1595,1970,2510,2420),
      array(1.9,1670,2060,2630,2520),
      array(2.0,1745,2150,2750,2620),
      ),
    // 小包郵便物:航空小包
    'jppercelair'=>array(
      array( 0.5, 1700, 2100, 2500, 3200),// 0.5kg以下,第1,第2,第3,第4地帯
      array( 1.0, 2050, 2700, 3350, 4600),
      array( 1.5, 2400, 3300, 4200, 6000),
      array( 2.0, 2750, 3900, 5050, 7400),
      array( 2.5, 3100, 4500, 5900, 8800),
      array( 3.0, 3450, 5100, 6750,10200),
      array( 3.5, 3800, 5700, 7600,11600),
      array( 4.0, 4150, 6300, 8450,13000),
      array( 4.5, 4500, 6900, 9300,14400),
      array( 5.0, 4850, 7500,10150,15800),
      array( 5.5, 5150, 8000,10900,17000),
      array( 6.0, 5450, 8500,11650,18200),
      array( 6.5, 5750, 9000,12400,19400),
      array( 7.0, 6050, 9500,13150,20600),
      array( 7.5, 6350,10000,13900,21800),
      array( 8.0, 6650,10500,14650,23000),
      array( 8.5, 6950,11000,15400,24200),
      array( 9.0, 7250,11500,16150,25400),
      array( 9.5, 7550,12000,16900,26600),
      array(10.0, 7850,12500,17650,27800),
      array(11.0, 8250,13200,18600,29400),
      array(12.0, 8650,13900,19550,31000),
      array(13.0, 9050,14600,20500,32600),
      array(14.0, 9450,15300,21450,34200),
      array(15.0, 9850,16000,22400,35800),
      array(16.0,10250,16700,23350,37400),
      array(17.0,10650,17400,24300,39000),
      array(18.0,11050,18100,25250,40600),
      array(19.0,11450,18800,26200,42200),
      array(20.0,11850,19500,27150,43800),
      array(21.0,12250,20200,28100,45400),
      array(22.0,12650,20900,29050,47000),
      array(23.0,13050,21600,30000,48600),
      array(24.0,13450,22300,30950,50200),
      array(25.0,13850,23000,31900,51800),
      array(26.0,14250,23700,32850,53400),
      array(27.0,14650,24400,33800,55000),
      array(28.0,15050,25100,34750,56500),
      array(29.0,15450,25800,35700,58200),
      array(30.0,15850,26500,36650,59800),
      ),
    // 小包郵便物:エコノミー航空(SAL)小包
    'jppercelsal'=>array(
      array( 0.5, 1800, 2200, 2700, 3400),// 0.5kg以下,第1,第2,第3,第4地帯
      array( 1.0, 1800, 2200, 2700, 3400),
      array( 1.5, 2400, 2900, 3850, 5000),
      array( 2.0, 2400, 2900, 3850, 5000),
      array( 2.5, 3000, 3600, 5000, 6600),
      array( 3.0, 3000, 3600, 5000, 6600),
      array( 3.5, 3600, 4300, 6150, 8200),
      array( 4.0, 3600, 4300, 6150, 8200),
      array( 4.5, 4200, 5000, 7300, 9800),
      array( 5.0, 4200, 5000, 7300, 9800),
      array( 5.5, 4700, 5600, 8350,11250),
      array( 6.0, 4700, 5600, 8350,11250),
      array( 6.5, 5200, 6200, 9400,12700),
      array( 7.0, 5200, 6200, 9400,12700),
      array( 7.5, 5700, 6800,10450,14150),
      array( 8.0, 5700, 6800,10450,14150),
      array( 8.5, 6200, 7400,11500,15600),
      array( 9.0, 6200, 7400,11550,15600),
      array( 9.5, 6700, 8000,12550,17050),
      array(10.0, 6700, 8000,12550,17050),
      array(11.0, 7000, 8400,13250,18050),
      array(12.0, 7300, 8800,13950,19050),
      array(13.0, 7600, 9200,14650,20050),
      array(14.0, 7900, 9600,15350,21050),
      array(15.0, 8200,10000,16050,22050),
      array(16.0, 8500,10400,16750,23050),
      array(17.0, 8800,10800,17450,24050),
      array(18.0, 9100,11200,18150,25050),
      array(19.0, 9400,11600,18850,26050),
      array(20.0, 9700,12000,19550,27050),
      array(21.0,10000,12400,20250,28050),
      array(22.0,10300,12800,20950,29050),
      array(23.0,10600,13200,21650,30050),
      array(24.0,10900,13600,22350,31050),
      array(25.0,11200,14000,23050,32050),
      array(26.0,11500,14400,23750,33050),
      array(27.0,11800,14800,24450,34050),
      array(28.0,12100,15200,25150,35050),
      array(29.0,12400,15600,25850,36050),
      array(30.0,12700,16000,26550,37050),
      ),
    // 小包郵便物:船便小包
    'jppercelsea'=>array(
      array( 0.5, 1600, 1700, 1800, 2200),// 0.5kg以下,第1,第2,第3,第4地帯
      array( 1.0, 1600, 1700, 1800, 2200),
      array( 1.5, 1900, 2100, 2350, 2650),
      array( 2.0, 1900, 2100, 2350, 2650),
      array( 2.5, 2200, 2500, 2900, 3100),
      array( 3.0, 2200, 2500, 2900, 3100),
      array( 3.5, 2500, 2900, 3450, 3550),
      array( 4.0, 2500, 2900, 3450, 3550),
      array( 4.5, 2800, 3300, 4000, 4000),
      array( 5.0, 2800, 3300, 4000, 4000),
      array( 5.5, 3100, 3700, 4550, 4450),
      array( 6.0, 3100, 3700, 4550, 4450),
      array( 6.5, 3400, 4100, 5100, 4900),
      array( 7.0, 3400, 4100, 5100, 4900),
      array( 7.5, 3700, 4500, 5650, 5350),
      array( 8.0, 3700, 4500, 5650, 5350),
      array( 8.5, 4000, 4900, 6200, 5800),
      array( 9.0, 4000, 4900, 6200, 5800),
      array( 9.5, 4300, 5300, 6750, 6250),
      array(10.0, 4300, 5300, 6750, 6250),
      array(11.0, 4550, 5600, 7100, 6600),
      array(12.0, 4800, 5900, 7450, 6950),
      array(13.0, 5050, 6200, 7800, 7300),
      array(14.0, 5300, 6500, 8150, 7650),
      array(15.0, 5550, 6800, 8500, 8000),
      array(16.0, 5800, 7100, 8850, 8350),
      array(17.0, 6050, 7400, 9200, 8700),
      array(18.0, 6300, 7700, 9550, 9050),
      array(19.0, 6550, 8000, 9900, 9400),
      array(20.0, 6800, 8300,10250, 9750),
      array(21.0, 7050, 8600,10600,10100),
      array(22.0, 7300, 8900,10950,10450),
      array(23.0, 7550, 9200,11300,10800),
      array(24.0, 7800, 9500,11650,11150),
      array(25.0, 8050, 9800,12000,11500),
      array(26.0, 8300,10100,12350,11850),
      array(27.0, 8550,10400,12700,12200),
      array(28.0, 8800,10700,13050,12550),
      array(29.0, 9050,11000,13400,12900),
      array(30.0, 9300,11300,13750,13250),
      ),
    // 国際スピード郵便(EMS) 04-2021
    /*'jppercelems'=>array(
      array( 0.5, 1400, 2000, 2200, 2400),// 0.5kg以下,第1,第2-1,第2-2,第3地帯
      array( 0.6, 1540, 2180, 2400, 2740),
      array( 0.7, 1680, 2360, 2600, 3080),
      array( 0.8, 1820, 2540, 2800, 3420),
      array( 0.9, 1960, 2720, 3000, 3760),
      array( 1.0, 2100, 2900, 3200, 4100),
      array( 1.25,2400, 3300, 3650, 4900),
      array( 1.5, 2700, 3700, 4100, 5700),
      array( 1.75,3000, 4100, 4550, 6500),
      array( 2.0, 3300, 4500, 5000, 7300),
      array( 2.5, 3800, 5200, 5800, 8800),
      array( 3.0, 4300, 5900, 6600,10300),
      array( 3.5, 4800, 6600, 7400,11800),
      array( 4.0, 5300, 7300, 8200,13300),
      array( 4.5, 5800, 8000, 9000,14800),
      array( 5.0, 6300, 8700, 9800,16300),
      array( 5.5, 6800, 9400,10600,17800),
      array( 6.0, 7300,10100,11400,19300),
      array( 7.0, 8100,11200,12700,21400),
      array( 8.0, 8900,12300,14000,23500),
      array( 9.0, 9700,13400,15300,25600),
      array(10.0,10500,14500,16600,27700),
      array(11.0,11300,15600,17900,29800),
      array(12.0,12100,16700,19200,31900),
      array(13.0,12900,17800,20500,34000),
      array(14.0,13700,18900,21800,36100),
      array(15.0,14500,20000,23100,38200),
      array(16.0,15300,21100,24400,40300),
      array(17.0,16100,22200,25700,42400),
      array(18.0,16900,23300,27000,44500),
      array(19.0,17700,24400,28300,46600),
      array(20.0,18500,25500,29600,48700),
      array(21.0,19300,26600,30900,50800),
      array(22.0,20100,27700,32200,52900),
      array(23.0,20900,28800,33500,55000),
      array(24.0,21700,29900,34800,57100),
      array(25.0,22500,31000,36100,59200),
      array(26.0,23300,32100,37400,61300),
      array(27.0,24100,33200,38700,63400),
      array(28.0,24900,34300,40000,65500),
      array(29.0,25700,35400,41300,67600),
      array(30.0,26500,36500,42600,69700),
      ),
	  */
	  // 国際スピード郵便(EMS) 06-2021 extra charge zone 2
    'jppercelems'=>array(
      array( 0.5, 1400, 2400, 2450, 2400),// 0.5kg以下,第1,第2-1,第2-2,第3地帯
      array( 0.6, 1540, 2660, 2700, 2740),
      array( 0.7, 1680, 2920, 2950, 3080),
      array( 0.8, 1820, 3180, 3200, 3420),
      array( 0.9, 1960, 3440, 3450, 3760),
      array( 1.0, 2100, 3700, 3700, 4100),
      array( 1.25,2400, 4340, 4300, 4900),
      array( 1.5, 2700, 4900, 4850, 5700),
      array( 1.75,3000, 5540, 5450, 6500),
      array( 2.0, 3300, 6100, 6000, 7300),
      array( 2.5, 3800, 7200, 7050, 8800),
      array( 3.0, 4300, 8300, 8100,10300),
      array( 3.5, 4800, 9400, 9150,11800),
      array( 4.0, 5300,10500,10200,13300),
      array( 4.5, 5800,11600,11250,14800),
      array( 5.0, 6300,12700,12300,16300),
      array( 5.5, 6800,13800,13350,17800),
      array( 6.0, 7300,14900,14400,19300),
      array( 7.0, 8100,16800,16200,21400),
      array( 8.0, 8900,18700,18000,23500),
      array( 9.0, 9700,20600,19800,25600),
      array(10.0,10500,22500,21600,27700),
      array(11.0,11300,24400,23400,29800),
      array(12.0,12100,26300,25200,31900),
      array(13.0,12900,28200,27000,34000),
      array(14.0,13700,30100,28800,36100),
      array(15.0,14500,32000,30600,38200),
      array(16.0,15300,33900,32400,40300),
      array(17.0,16100,35800,34200,42400),
      array(18.0,16900,37700,36000,44500),
      array(19.0,17700,39600,37800,46600),
      array(20.0,18500,41500,39600,48700),
      array(21.0,19300,43400,41400,50800),
      array(22.0,20100,45300,43200,52900),
      array(23.0,20900,47200,45000,55000),
      array(24.0,21700,49100,46800,57100),
      array(25.0,22500,51000,48600,59200),
      array(26.0,23300,52900,50400,61300),
      array(27.0,24100,54800,52200,63400),
      array(28.0,24900,56700,54000,65500),
      array(29.0,25700,58600,55800,67600),
      array(30.0,26500,60500,57600,69700),
      ),
    );

    // コンストラクタ
    // $id:   module id
    // $titl: module name
    // $country: country code
    function __construct($id, $title, $country = NULL) {
        $this->quote = array('id' => $id, 'title' => $title);
        $this->SetDest($country);
    }
    function SetDest($country) {
        if($country) {
            $this->DestCountryCode = $country;
        }
    }
    function SetWeight($weight) {
        $this->Weight = $weight;
    }
    // 国コードをエリア名に変換する
    // 国コードが見つからなければ空文字を返す
    function GetAreaName($contry_code) {
        foreach ($this->Areas as $areaname => $a_country) {
            if ( in_array($contry_code, $a_country) ) {
                return $areaname;
            }
        }
        return '';
    }
    // エリア名から地帯番号(1～4)に変換する
    // $areaname: エリア名
    function GetZoneNo($areaname) {
        $area_to_no = array();

        switch ($this->quote['id']) {
        case 'jppercelairs':
        case 'jppercelseas':
        case 'jppercelsals':
          $area_to_no = array(
            'easia'   =>1, //東アジア
            'wpacific'=>4, //西太平洋
            'seasia'  =>1, //東南アジア
            'swasia'  =>1, //西南アジア
            'oceania' =>2, //オセアニア
            'mneast'  =>2, //中近東
            'europe'  =>2, //ヨーロッパ
            'namerica'=>2, //北米
            'camerica'=>2, //中米
            'samerica'=>3, //南米
            'africa'  =>3, //アフリカ
			'america' =>4, //USA
          );
          break;
        case 'jppercelair':
        case 'jppercelsal':
        case 'jppercelsea':
          $area_to_no = array(
            'easia'   =>1, //東アジア
            'wpacific'=>1, //西太平洋
            'seasia'  =>2, //東南アジア
            'swasia'  =>2, //西南アジア
            'oceania' =>3, //オセアニア
            'mneast'  =>3, //中近東
            'europe'  =>3, //ヨーロッパ
            'namerica'=>3, //北米
            'camerica'=>3, //中米
			'america' =>3, //USA
            'samerica'=>4, //南米
            'africa'  =>4, //アフリカ
          );
          break;
        case 'jppercelems':
          $area_to_no = array(
            'easia'   =>1, //東アジア
            'wpacific'=>2, //西太平洋
            'seasia'  =>1, //東南アジア
            'swasia'  =>1, //西南アジア
            'oceania' =>2, //オセアニア
            'mneast'  =>2, //中近東
            'europe'  =>3, //ヨーロッパ
            'namerica'=>2, //北米
            'camerica'=>2, //中米
            'america' =>2, //USA
            'samerica'=>4, //南米
            'africa'  =>4, //アフリカ
          );
          break;
        }
        return $area_to_no[$areaname];
    }

    function GetQuote() {
        $this->quote['cost'] = 0;
        $areaname = $this->GetAreaName($this->DestCountryCode);
        if ( $areaname ) {
            $no = $this->GetZoneNo($areaname);
            if ( $no ) {
                // 価格ランク: (最大重量(kg),第1地帯,第2地帯,第3地帯,第4地帯)
                foreach($this->a_price_percel[$this->quote['id']] as $a_set) {
                    if ($this->Weight <= $a_set[0]) {
                        $this->quote['cost'] = $a_set[$no];
                        break;
                    }
                }
                if (!$this->quote['cost']) {
                    $this->quote['error'] = MODULE_SHIPPING_JPPERCEL_TEXT_OVERSIZE;
                }
                // $this->quote['DEBUG'] = ' DestCountryCode=' . $this->DestCountryCode; //DEBUG
            } else {
				// 実際には起こらないはず
                $this->quote['error'] = MODULE_SHIPPING_JPPERCEL_TEXT_ILLEGAL_AREA . '(' . $this->DestCountryCode .')';
            }
        } else {
            $this->quote['error'] = MODULE_SHIPPING_JPPERCEL_TEXT_OUT_OF_AREA . '(' . $this->DestCountryCode . ')';
        }

        return $this->quote;
    }
}

}
?>
