<?php
$define = [
    'HEADING_TITLE' => 'ビジターズカート / メンバーズカート',
    'SUB_HEADING_TITLE_1' => 'ビジターズカート',
    'SUB_HEADING_TITLE_2' => 'メンバーズカート',
    'SUB_HEADING_TITLE_3' => 'カートについて',
    'SUB_HEADING_TEXT_1' => '当ショップをご利用になるすべてのお客様は\'ビジターズカート\'を使用でき、当ショップのアカウントを廃止されるまで、このカートに商品を入れておくことができます。',
    'SUB_HEADING_TEXT_2' => 'アカウントをお持ちのお客様は、\'メンバーズカート\'が使用できます。メンバーズカートに入れた商品は、一度ログアウトした後でもその商品をお買い上げになるかご自身でカートから削除されるまで保存されます。',
    'SUB_HEADING_TEXT_3' => 'アカウントをお持ちのお客様が\'ビジターズカート\'に商品を入れた後にログインされると、\'ビジターズカート\'の中身は自動的に\'メンバーズカート\'の中に入ります。',
];

return $define;
