<?php
$define = [
    'NAVBAR_TITLE' => 'クッキー(Cookie)について',
    'HEADING_TITLE' => 'クッキー(Cookie)の使用について',
    'TEXT_INFORMATION' => 'Webブラウザのクッキー(Cookie)が未設定、あるいは無効となっています。',
    'TEXT_INFORMATION_2' => 'お買い物をを続けられる場合は、Webブラウザのクッキー(Cookie)をオンにすることをお薦めします。',
    'TEXT_INFORMATION_3' => 'お使いのWebブラウザが<strong>Internet Explorer</strong>の場合には、以下の方法で設定を変更することができます。<br /><ol><li>「ツール > インターネットオプション」を選択する。</li><li>「セキュリティ」のタブをクリックし、「インターネット」ゾーンのセキュリティのレベルを「中」に設定する。</li></ol>',
    'TEXT_INFORMATION_4' => 'お客様のセキュリティ保護のため、当ショップではこのような措置をとらせていただいております。お手数をおかけして申し訳ございませんが、ご了承いただきますようお願い申し上げます。',
    'TEXT_INFORMATION_5' => 'クッキーの設定についてなどご質問がありましたら、ショップ管理者までお問い合わせください。',
    'BOX_INFORMATION_HEADING' => '<strong>クッキー(Cookie)のプライバシーとセキュリティについて</strong>',
    'BOX_INFORMATION' => '当ショップでショッピングをしてただくためには、クッキー(Cookie)の設定が必要です。これはお客様のショッピングにおいてプライバシーとセキュリティを保護するためです。<br /><br />Webブラウザのクッキー(Cookie)の設定をオンにすることで、お客様のPCと当ショップ間のデータ送受信を確実にし、またお客様の個人情報の漏洩を防止することができます。',
];

return $define;