<?php
$define = [
	'WARNING_SESSION_TIMEOUT' => '申し訳ありませんが、ログイン セッションの有効期限が切れています。ショッピングの選択が保存されました。<br><br>表示されている場合は、上の [ホーム] リンクをクリックし、再度ログインしてカートの内容を確認し、チェックアウトを完了してください。<br><br>または、ブラウザの [戻る] ボタンを使用してこのページにアクセスした場合は、もう一度先に進んで [ホーム] リンクにアクセスしてください。よろしくお願いいたします！',
	'ERROR_PAYMENT_FAILURE_TEXT' => 'お支払い手続きを完了することができません、他の支払方法を入力して下さい。',
	'TEXT_3DS_PAYER_AUTH_FRAME_TITLE_MESSAGE' => '<span style="color: blue;">注文処理中です、しばらくお待ち下さい... <br><br>あなたの安全のために、銀行の認証画面が下に表示されます。<br>必要情報を入力後、『送信』ボタンをクリックし、購入手続きを完了させてください。<br><br><em>更新または戻るボタンをクリックしないでください。このトランザクションは中断またはキャンセルされる可能性があります。</em></span>',
	'TEXT_3DS_CARD_MAY_BE_ENROLLED' => '<span style="color: blue; font-weight: bold;">お使いのカードは、Verified by Visa&#153; または MasterCard&#174; SecureCode&#153; の資格があるか、登録されている可能性があります。下の [確認] をクリックすると、購入を完了する前に詳細情報の入力を求められる場合があります。</span>',
];

return $define;
